const userInput = document.getElementById("UserInput");
const ipaOutput = document.getElementById("IPAoutput");
const copyButton = document.getElementById("CopyButton");
const xsIn=['__r\\`','\|\\\|\\','J\\_<','G\\_<','_H_T','_B_L','_R_F','__h\\','__r\\','__\?\\','__s\\','__J\\','__I\\','__j\\','__l`','__L\\','__M\\','__n`','__N\\','__p\\','__s`','__v\\','__z`','__z\\','b_<','d_<','g_<','r\\`','_\?\\','<R>','<F>','__r','__R','__s','__x','__@','__t','__T','_00','t\\\\','d\\\\','n\\\\','l\\\\','__y','__\?','__a','__6','__A','__{','__b','__d','__e','__E','__3','__k','__m','__N','__o','__O','__p','__u','__M','__v','__B','__X','__Q','__c','__D','__f','__g','__H','__1','__I','__F','__J','__8','__S','__\}','__U','__P','__V','__z','__Z','__i','__n','__9','X\\','\|\\','=\\','\!\\','s\\','d`','@\\','@`','3`','3\\','J\\','G\\','h\\','x\\','l`','K\\','M\\','n`','N\\','p\\','r\\','l\\','r`','R\\','s`','t`','v\\','z`','z\\','\?\\','O\\','B\\','H\\','j\\','L\\','>\\','<\\','_h','_j','_w','_>',':\\','_G','_l','_L','_H','_F','_\\','_~','_M','_X','_\"','_T','_R','_/','_B','_A','_q','_\}','_c','_r','_o','_\+','_\-','_t','_0','_=','_d','_v','_\^','_k','_e','_O','_a','_m','_N','_x','I\\','U\\','\|\|','\-\\','_n','v`','W\\','D\\','\"\"','%%','{','C','D','2','N','9','6','A','Q','O','@','E','3','g','G','7','H','1','I','5','K','M','F','J','8','&','4','R','S','\}','U','P','V','W','L','Y','Z','\?','\'','\"','%',':','`','~','=','B','T','X','\^','\!','*'];
const ipaOut=['ʵ','ǁ','ʄ','ʛ','᷄','᷅','᷈','ʱ','ʴ','ˁ','ᶝ','ᶡ','ᶧ','ᶨ','ᶩ','ᶫ','ᶭ','ᶯ','ᶰ','ᶲ','ᶳ','ᶹ','ᶼ','ᶽ','ɓ','ɗ','ɠ','ɻ','ˤ','↗','↘','ʳ','ʶ','ˢ','ˣ','ᵊ','ᵗ','ᶿ','̊','ȶ','ȡ','ȵ','ȴ','ʸ','ˀ','ᵃ','ᵄ','ᵅ','ᵆ','ᵇ','ᵈ','ᵉ','ᵋ','ᵌ','ᵏ','ᵐ','ᵑ','ᵒ','ᵓ','ᵖ','ᵘ','ᵚ','ᵛ','ᵝ','ᵡ','ᶛ','ᶜ','ᶞ','ᶠ','ᶢ','ᶣ','ᶤ','ᶦ','ᶬ','ᶮ','ᶱ','ᶴ','ᶶ','ᶷ','ᶹ','ᶺ','ᶻ','ᶾ','ⁱ','ⁿ','ꟹ','ħ','ǀ','ǂ','ǃ','ɕ','ɖ','ɘ','ɚ','ɝ','ɞ','ɟ','ɢ','ɦ','ɧ','ɭ','ɮ','ɰ','ɳ','ɴ','ɸ','ɹ','ɺ','ɽ','ʀ','ʂ','ʈ','ʋ','ʐ','ʑ','ʕ','ʘ','ʙ','ʜ','ʝ','ʟ','ʡ','ʢ','ʰ','ʲ','ʷ','ʼ','ˑ','ˠ','ˡ','̀','́','̂','̂','̃','̄','̆','̈','̋','̌','̌','̏','̘','̙','̚','̜','̝','̞','̟','̠','̤','̥','̩','̪','̬','̯','̰','̴','̹','̺','̻','̼','̽','ᵻ','ᵿ','‖','‿','ⁿ','ⱱ','ʬ','ʭ','\u0341','\u0340','æ','ç','ð','ø','ŋ','œ','ɐ','ɑ','ɒ','ɔ','ə','ɛ','ɜ','ɡ','ɣ','ɤ','ɥ','ɨ','ɪ','ɫ','ɬ','ɯ','ɱ','ɲ','ɵ','ɶ','ɾ','ʁ','ʃ','ʉ','ʊ','ʋ','ʌ','ʍ','ʎ','ʏ','ʒ','ʔ','ʲ','\ˈ','ˌ','ː','˞','̃','̩','β','θ','χ','ꜛ','ꜜ','͡'];

userInput.focus();
userInput.addEventListener("input", function() {
    let result = userInput.value;
    for(let i = 0; i < xsIn.length; i++) {
        result = result.replaceAll(xsIn[i], ipaOut[i]);
    }
    ipaOutput.value = result;
    ipaOutput.scrollTop = ipaOutput.scrollHeight;
});
userInput.addEventListener("keydown", function(evt) {
    if (evt.key == "Enter") {
        copyResult();
    }
});
copyButton.addEventListener("click", function() {
    copyResult();
});
function copyResult() {
    ipaOutput.select();
    document.execCommand("copy");
    userInput.select();
    userInput.focus();
}
